# CreatePartsWithoutDabasebase Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SystemsFailures..::..CreatePartsWithoutDabasebase Property
BuiltInFailures..::..SystemsFailures Class See Also
---
Parts were not created because fabrication configuration is not available.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CreatePartsWithoutDabasebase { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CreatePartsWithoutDabasebase As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CreatePartsWithoutDabasebase {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SystemsFailures Class
Autodesk.Revit.DB Namespace